Core/src/AccumulationRegisters/ОстаткиНалоговыхЛьгот/ОстаткиНалоговыхЛьгот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНалоговыхЛьгот</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/ОстаткиНалоговыхЛьгот/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью набора записей.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Установка исключительной блокировки текущего набора записей регистратора.
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНалоговыхЛьгот.НаборЗаписей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Отбор.Регистратор.Значение);
	Блокировка.Заблокировать();
	
	Если НЕ СтруктураВременныеТаблицы.Свойство("ДвиженияОстаткиНалоговыхЛьготИзменение") ИЛИ
		СтруктураВременныеТаблицы.Свойство("ДвиженияОстаткиНалоговыхЛьготИзменение") И НЕ СтруктураВременныеТаблицы.ДвиженияЗапасыИзменение Тогда
		
		// Если временная таблица "ДвиженияЗапасыИзменение" не существует или не содержит записей
		// об изменении набора, значит набор записывается первый раз или для набора был выполнен контроль остатков.
		// Текущее состояние набора помещается во временную таблицу "ДвиженияЗапасыПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно текущего.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОстаткиНалоговыхЛьгот.НомерСтроки КАК НомерСтроки,
		|	ОстаткиНалоговыхЛьгот.Организация КАК Организация,
		|	ОстаткиНалоговыхЛьгот.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ОстаткиНалоговыхЛьгот.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ОстаткиНалоговыхЛьгот.Сумма
		|		ИНАЧЕ -ОстаткиНалоговыхЛьгот.Сумма
		|	КОНЕЦ КАК СуммаПередЗаписью
		|ПОМЕСТИТЬ ДвиженияОстаткиНалоговыхЛьготПередЗаписью
		|ИЗ
		|	РегистрНакопления.ОстаткиНалоговыхЛьгот КАК ОстаткиНалоговыхЛьгот
		|ГДЕ
		|	ОстаткиНалоговыхЛьгот.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	Иначе
		
		// Если временная таблица "ДвиженияЗапасыИзменение" существует и содержит записи
		// об изменении набора, значит набор записывается не первый раз и для набора не был выполнен контроль остатков.
		// Текущее состояние набора и текущее состояние изменений помещаются во временную таблцу "ДвиженияЗапасыПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно первоначального.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияОстаткиНалоговыхЛьготИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияОстаткиНалоговыхЛьготИзменение.Организация КАК Организация,
		|	ДвиженияОстаткиНалоговыхЛьготИзменение.Сотрудник КАК Сотрудник,
		|	ДвиженияОстаткиНалоговыхЛьготИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью
		|ПОМЕСТИТЬ ДвиженияОстаткиНалоговыхЛьготПередЗаписью
		|ИЗ
		|	ДвиженияОстаткиНалоговыхЛьготИзменение КАК ДвиженияОстаткиНалоговыхЛьготИзменение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиНалоговыхЛьгот.НомерСтроки,
		|	ОстаткиНалоговыхЛьгот.Организация,
		|	ОстаткиНалоговыхЛьгот.Сотрудник,
		|	ВЫБОР
		|		КОГДА ОстаткиНалоговыхЛьгот.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ОстаткиНалоговыхЛьгот.Сумма
		|		ИНАЧЕ -ОстаткиНалоговыхЛьгот.Сумма
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ОстаткиНалоговыхЛьгот КАК ОстаткиНалоговыхЛьгот
		|ГДЕ
		|	ОстаткиНалоговыхЛьгот.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	КонецЕсли;
	
	// Временная таблица "ДвиженияЗапасыИзменение" уничтожается
	// Удаляется информация о ее существовании.
	
	Если СтруктураВременныеТаблицы.Свойство("ДвиженияОстаткиНалоговыхЛьготИзменение") Тогда
		
		Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияОстаткиНалоговыхЛьготИзменение");
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		СтруктураВременныеТаблицы.Удалить("ДвиженияОстаткиНалоговыхЛьготИзменение");
	
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриЗаписи набора записей.
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу "ДвиженияЗапасыИзменение".
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МИНИМУМ(ДвиженияОстаткиНалоговыхЛьготИзменение.НомерСтроки) КАК НомерСтроки,
	|	ДвиженияОстаткиНалоговыхЛьготИзменение.Организация КАК Организация,
	|	ДвиженияОстаткиНалоговыхЛьготИзменение.Сотрудник КАК Сотрудник,
	|	СУММА(ДвиженияОстаткиНалоговыхЛьготИзменение.СуммаПередЗаписью) КАК СуммаПередЗаписью,
	|	СУММА(ДвиженияОстаткиНалоговыхЛьготИзменение.СуммаИзменение) КАК СуммаИзменение,
	|	СУММА(ДвиженияОстаткиНалоговыхЛьготИзменение.СуммаПриЗаписи) КАК СуммаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияОстаткиНалоговыхЛьготИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияОстаткиНалоговыхЛьготПередЗаписью.НомерСтроки КАК НомерСтроки,
	|		ДвиженияОстаткиНалоговыхЛьготПередЗаписью.Организация КАК Организация,
	|		ДвиженияОстаткиНалоговыхЛьготПередЗаписью.Сотрудник КАК Сотрудник,
	|		ДвиженияОстаткиНалоговыхЛьготПередЗаписью.СуммаПередЗаписью КАК СуммаПередЗаписью,
	|		ДвиженияОстаткиНалоговыхЛьготПередЗаписью.СуммаПередЗаписью КАК СуммаИзменение,
	|		0 КАК СуммаПриЗаписи
	|	ИЗ
	|		ДвиженияОстаткиНалоговыхЛьготПередЗаписью КАК ДвиженияОстаткиНалоговыхЛьготПередЗаписью
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияОстаткиНалоговыхЛьготПриЗаписи.НомерСтроки,
	|		ДвиженияОстаткиНалоговыхЛьготПриЗаписи.Организация,
	|		ДвиженияОстаткиНалоговыхЛьготПриЗаписи.Сотрудник,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияОстаткиНалоговыхЛьготПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияОстаткиНалоговыхЛьготПриЗаписи.Сумма
	|			ИНАЧЕ ДвиженияОстаткиНалоговыхЛьготПриЗаписи.Сумма
	|		КОНЕЦ,
	|		ДвиженияОстаткиНалоговыхЛьготПриЗаписи.Сумма
	|	ИЗ
	|		РегистрНакопления.ОстаткиНалоговыхЛьгот КАК ДвиженияОстаткиНалоговыхЛьготПриЗаписи
	|	ГДЕ
	|		ДвиженияОстаткиНалоговыхЛьготПриЗаписи.Регистратор = &Регистратор) КАК ДвиженияОстаткиНалоговыхЛьготИзменение
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияОстаткиНалоговыхЛьготИзменение.Организация,
	|	ДвиженияОстаткиНалоговыхЛьготИзменение.Сотрудник
	|
	|ИМЕЮЩИЕ
	|		СУММА(ДвиженияОстаткиНалоговыхЛьготИзменение.СуммаИзменение) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	// Новые изменения были помещены во временную таблицу "ДвиженияЗапасыИзменение".
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияОстаткиНалоговыхЛьготИзменение", ВыборкаИзРезультатаЗапроса.Количество > 0);
	
	// Временная таблица "ДвиженияЗапасыПередЗаписью" уничтожается
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияОстаткиНалоговыхЛьготПередЗаписью");
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры // ПриЗаписи()

#КонецОбласти

#КонецЕсли
